//ASMLAB2  JOB 1,'ASM LAB02',
//             CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//* ================================================================
//* LAB 02 - DEFINING STORAGE
//* PART 1 - SIGNED BINARY INTEGERS
//* ================================================================
//ASM      EXEC ASMAC
//C.SYSIN DD *
LAB001   CSECT

***********************************************************************
* HALFWORDS - 16 BIT SIGNED BINARY INTEGERS
***********************************************************************
H1       DC    H'100'
H2       DC    H'-1'
H3       DC    H'32767'

***********************************************************************
* FULLWORDS - 32 BIT SIGNED BINARY INTEGERS
***********************************************************************
F1       DC    F'100'
F2       DC    F'-1'
F3       DC    F'32768'

***********************************************************************
* DOUBLEWORDS - 64 BIT SIGNED BINARY INTEGERS
***********************************************************************
D1       DC    FD'100'
D2       DC    FD'0'
D3       DC    FD'-4095'

         END   LAB001
/*
